In [1]:
import pandas as pd

In [2]:
school_data_to_load = "Resources/schools_complete.csv"
student_data_to_load = "Resources/students_complete.csv"

In [3]:
school_data = pd.read_csv(school_data_to_load)
student_data = pd.read_csv(student_data_to_load)

In [4]:
school_data_complete = pd.merge(student_data, school_data, how="left", on=["school_name", "school_name"])

In [5]:
school_data_complete.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [6]:
school_data_complete["school_name"].value_counts()

Bailey High School       4976
Johnson High School      4761
Hernandez High School    4635
Rodriguez High School    3999
Figueroa High School     2949
Huang High School        2917
Ford High School         2739
Wilson High School       2283
Cabrera High School      1858
Wright High School       1800
Shelton High School      1761
Thomas High School       1635
Griffin High School      1468
Pena High School          962
Holden High School        427
Name: school_name, dtype: int64

In [7]:
school_data_complete["school_name"].nunique()

15

In [8]:
school_data_complete["student_name"].count()

39170

In [9]:
school_data_complete.describe()

,Student ID,reading_score,math_score,School ID,size,budget
count,39170.000000,39170.00000,39170.000000,39170.000000,39170.000000,3.917000e+04
mean,19584.500000,81.87784,78.985371,6.978172,3332.957110,2.117241e+06
std,11307.549359,10.23958,12.309968,4.444329,1323.914069,8.749987e+05
min,0.000000,63.00000,55.000000,0.000000,427.000000,2.480870e+05
25%,9792.250000,73.00000,69.000000,3.000000,1858.000000,1.081356e+06
50%,19584.500000,82.00000,79.000000,7.000000,2949.000000,1.910635e+06
75%,29376.750000,91.00000,89.000000,11.000000,4635.000000,3.022020e+06
max,39169.000000,99.00000,99.000000,14.000000,4976.000000,3.124928e+06

In [10]:
school_data_complete[["school_name", "budget"]].head()

         school_name   budget
0  Huang High School  1910635
1  Huang High School  1910635
2  Huang High School  1910635
3  Huang High School  1910635
4  Huang High School  1910635

In [11]:
school_data_complete[["school_name", "budget"]]["budget"].unique().sum()

24649428

In [23]:
school_budget = school_data_complete[["school_name", "budget"]]
school_group = school_budget.groupby(["school_name"])
school_group.head()
school_group.count()

                       budget
school_name
Bailey High School       4976
Cabrera High School      1858
Figueroa High School     2949
Ford High School         2739
Griffin High School      1468
Hernandez High School    4635
Holden High School        427
Huang High School        2917
Johnson High School      4761
Pena High School          962
Rodriguez High School    3999
Shelton High School      1761
Thomas High School       1635
Wilson High School       2283
Wright High School       1800

In [12]:
school_data_complete["math_score"].mean()

78.98537145774827

In [13]:
school_data_complete["reading_score"].mean()

81.87784018381414

In [14]:
overall_score = (school_data_complete["math_score"] + school_data_complete["reading_score"]) / 2
school_data_complete["overall_score"] = overall_score
school_data_complete.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget,overall_score
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635,72.5
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635,77.5
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635,75.0
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635,62.5
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635,90.5

In [15]:
school_data_complete["overall_score"].mean()

80.43160582078121

In [16]:
(school_data_complete["math_score"].mean() + school_data_complete["reading_score"].mean()) / 2

80.43160582078121

In [25]:
condition = school_data_complete["math_score"] >= 70
school_data_complete[condition]["student_name"].count() / school_data_complete["student_name"].count()

0.749808526933878

In [26]:
condition = school_data_complete["reading_score"] >= 70
school_data_complete[condition]["student_name"].count() / school_data_complete["student_name"].count()

0.8580546336482001

In [32]:
total_schools = school_data_complete["school_name"].nunique()
total_students = school_data_complete["student_name"].count()
total_budget = school_data_complete[["school_name", "budget"]]["budget"].unique().sum()
average_math = school_data_complete["math_score"].mean()
average_reading = school_data_complete["reading_score"].mean()
percent_math = school_data_complete[school_data_complete["math_score"] >= 70]["student_name"].count() / school_data_complete["student_name"].count()
percent_reading = school_data_complete[school_data_complete["reading_score"] >= 70]["student_name"].count() / school_data_complete["student_name"].count()
overall_passing = (school_data_complete["math_score"].mean() + school_data_complete["reading_score"].mean()) / 2


results_df = pd.DataFrame({"Total Schools": total_schools,
                          "Total Students": total_students,
                          "Total Budget": '${:0,.2f}'.format(total_budget),
                          "Average Math Score": average_math,
                          "Average Reading Score": average_reading,
                          "% Passing Math": percent_math,
                          "% Passing Reading": percent_reading,
                          "% Overall Passing Rate": overall_passing}, index = [0])

results_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing Rate
0,15,39170,"$24,649,428.00",78.985371,81.87784,0.749809,0.858055,80.431606

In [ ]:
# rubric requires GroupBy to be used for the School summary stuff to follow